Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: ལྷག་མཐོང་གི་ཚོགས་བསགས་པ་ཡིན། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་ཚོགས་བསགས་པ་ཡིན་ཏེ། ཀླུའི་བདག་པོ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་ཚོགས་བསགས་པ་རྣམ་པ་བཅུ་དྲུག་པོ་དེ་དག་གིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འགྲོ་བར་འགྱུར་རོ། །
en: Lord of nāgas, the mind of omniscience correlates to omniscient wisdom in terms of these sixteen accumulations.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་ལམ་ལོག་པ་དང་། ལམ་ངན་པ་ཉི་ཤུ་རྩ་གཉིས་དང་བྲལ་ཏེ་རྣམ་པར་སྤངས་ན་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་ཏེ།
en: “Furthermore, lord of nāgas, when the mind of omniscience avoids the twenty-two misguided and wrong paths that are to be renounced, omniscient wisdom will be attained.

source: ཉི་ཤུ་རྩ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་སེམས་དང་བྲལ་བ་ཡིན། རང་སངས་རྒྱས་ཀྱི་སེམས་དང་བྲལ་བ་ཡིན། ང་རྒྱལ་དང་བྲལ་བ་ཡིན། ལྷག་པའི་ང་རྒྱལ་དང་བྲལ་བ་ཡིན། གཡོ་དང་བྲལ་བ་ཡིན། འཇིག་རྟེན་གྱི་གསང་ཚིག་ཀུན་ཏུ་འཛིན་པ་དང་བྲལ་བ་ཡིན། ལོག་པར་ཞུགས་པ་དང་བྲལ་བ་ཡིན། ཡོངས་སུ་སྐྱོ་བ་དང་བྲལ་བ་ཡིན། སྐྲག་པ་དང་བྲལ་བ་ཡིན། ཁེངས་པ་དང་རྩོད་པ་དང་བྲལ་བ་ཡིན། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་བྲལ་བ་ཡིན། ལས་ཀྱི་སྒྲིབ་པ་དང་བྲལ་བ་ཡིན། ཆོས་ཀྱི་སྒྲིབ་པ་དང་བྲལ་བ་ཡིན། བདག་ལ་སྟོད་པ་དང་གཞན་ལ་སྨོད་པ་དང་བྲལ་བ་ཡིན། སློབ་དཔོན་ཆོས་འཆབ་པ་དང་བྲལ་བ་ཡིན། བརྗེད་ངས་པའི་འདུ་ཤེས་དང་བྲལ་བ་ཡིན། སྡིག་པའི་གྲོགས་པོ་དང་བྲལ་བ་ཡིན།
en: What are the twenty-two?

source: དགེ་བའི་བཤེས་གཉེན་ལ་འཁུ་བ་དང་བྲལ་བ་ཡིན། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་མི་འཐུན་པའི་ཕྱོགས་དང་བྲལ་བ་ཡིན་ཏེ། འདི་ལྟར་སེར་སྣ་དང་། ངན་པའི་ངང་ཚུལ་དང་། གནོད་སེམས་དང་ལེ་ལོ་དང་གཡེང་བ་དང་འཆལ་བའི་ཤེས་རབ་དང་བྲལ་བ་ཡིན། ཆད་པ་དང་རྟག་པ་དང་བྲལ་བ་ཡིན།
en: They are avoidance of (1) the mindset of a hearer; (2) the mindset of a solitary buddha; (3) pride; (4) excessive pride; (5) duplicity; (6) attachment to worldly spells; (7) engagement with mistaken views; (8) being disheartened; (9) fear; (10) arrogance and combativeness; (11) desire, aversion, and delusion; (12) karmic obscuration; (13) confusion with regard to phenomena; (14) praising oneself and disparaging others; (15) teachers who withhold the Dharma; (16) forgetful perception; (17) unvirtuous companions; (18) hostility toward spiritual friends; (19) the discordant factors of the six perfections, namely miserliness, negative attitude, intolerance, laziness, distraction, and flawed insight; (20) nihilism and eternalism; (21) developing unskillful methods; and (22) all types of wrongdoing.

source: ཐབས་མི་མཁས་པའི་བསྡུ་བ་དང་བྲལ་བ་ཡིན། སྡིག་པ་ཐམས་ཅད་དང་བྲལ་བ་ཡིན་ཏེ། ཀླུའི་བདག་པོ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་ལམ་ལོག་པ་དང་། ལམ་ངན་པ་ཉི་ཤུ་རྩ་གཉིས་པོ་འདི་དག་དང་བྲལ་ཏེ། རྣམ་པར་སྤངས་ན་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་རོ། །
en: Lord of nāgas, if the mind of omniscience is free of these twenty-two misguided and wrong paths and has renounced them, omniscient wisdom will be attained.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དེ་རྒྱལ་མཚན་བཅུ་གཉིས་ཀྱིས་མངོན་པར་འཕགས་ན་བདུད་ཐམས་ཅད་དང་། བདུད་ཀྱི་རིས་ཐམས་ཅད་དང་། ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཐུལ་བར་དཀའ་བ་ཡིན་ཏེ།
en: “Furthermore, lord of nāgas, when bodhisattvas who have developed the mind of omniscience are ennobled by twelve banners, it will be very difficult for māras and their armies, indeed for any opponent, to vanquish them.

source: བཅུ་གཉིས་གང་ཞེ་ན། ཚུལ་ཁྲིམས་ཀྱི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། ཤེས་རབ་ཀྱི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་ཀྱི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། སྙིང་རྗེ་ཆེན་པོའི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། ཐབས་ཀྱི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། སྲོག་ཆགས་རྣམས་ལ་སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པའི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཁོང་དུ་ཆུད་པས། མཐར་ལྟ་བ་དང་བྲལ་བའི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། རང་གི་སེམས་ཡོངས་སུ་དག་པས་སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན།
en: What are the twelve?

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རློམ་སེམས་དང་། རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་དང་བྲལ་བའི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན། བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་རྒྱལ་མཚན་གྱིས་མངོན་པར་འཕགས་པ་ཡིན་ཏེ།
en: They are the ennobling banner of discipline; the ennobling banner of absorption; the ennobling banner of insight; the ennobling banner of liberating wisdom; the ennobling banner of great compassion; the ennobling banner of skillful means; the ennobling banner of emptiness, signlessness, and wishlessness; the ennobling banner of the lack of sentience, life force, and individuality in living beings; the ennobling banner of being free of extreme views and having understood dependent origination; the ennobling banner of being blessed by the Buddha through the complete purity of one’s own mind; the ennobling banner of omniscient wisdom that is free of assumptions, thoughts, concepts, and discursiveness; and the ennobling banner of not forgetting the mind of awakening.

source: ཀླུའི་བདག་པོ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དེ། རྒྱལ་མཚན་བཅུ་གཉིས་པོ་དེ་དག་གིས་མངོན་པར་འཕགས་ན། བདུད་ཐམས་ཅད་དང་། བདུད་ཀྱི་རིས་ཐམས་ཅད་དང་། ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཐུལ་བར་དཀའ་བ་ཡིན་ནོ། །
en: Lord of nāgas, when bodhisattvas who have developed the mind of omniscience are ennobled by these twelve banners, it is very difficult for māras and their armies, indeed for any opponent, to subdue them.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་གནས་གཉིས་ཏེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has two foundations.

source: གཉིས་གང་ཞེ་ན།
en: What are they?

source: འདི་ལྟ་སྟེ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པའི་གནས་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་གནས་ཏེ།
en: They are following through on one’s words and dedicating all roots of virtue toward perfect awakening.

source: གནས་ནི་གཉིས་པོ་དེ་དག་གོ། །
en: Those are the two.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་ཆུད་མི་ཟ་བ་གཉིས་ཏེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has two aspects that must not be lost.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་སྡང་བ་མེད་པའི་སེམས་དང་། ལོག་པར་ཞུགས་པ་རྣམས་ལ་ཆེར་སྙིང་རྗེ་བ་སྟེ།
en: They are not being angry toward any being and being especially compassionate toward those with wrong views.

source: གཉིས་པོ་དེ་དག་གོ། །
en: Those are the two.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་ཟུང་དུ་འབྲེལ་བའི་ཆོས་གཉིས་ཏེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has two qualities to be combined.

source: དེ་གཉིས་དང་འབྲེལ་ན་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པར་འགྱུར་ཏེ།
en: If these two are combined, the mind of omniscience will outshine all hearers and solitary buddhas.

source: ཐབས་དང་། ཤེས་རབ་སྟེ།
en: They are skillful means and insight.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རྟོན་པ་གཉིས་ཏེ།
en: “Furthermore, lord of nāgas, the mind of omniscience relies on two things.

source: སྒྲུབ་པ་རྣམས་ལ་འགྱོད་པ་མེད་པ་དང་། འགྱུར་བ་ལ་ཡིད་མི་ཆེས་པ་སྟེ།
en: They are not regretting what has already been done and not trusting that which is transient.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་ཡི་གེ་གཉིས་ཏེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has two characters.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་འདོད་པ་མེད་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཕན་ཡོན་དུ་མཐོང་བ་སྟེ།
en: They are being without attachment to the vehicle of hearers and the vehicle of solitary buddhas and seeing the benefits of the Great Vehicle.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རྒྱུན་ཆད་པ་གཉིས་ཏེ།
en: “Furthermore, lord of nāgas, there are two factors that interrupt the mind of omniscience.

source: སྒྱུ་དང་གཡོའི་རྒྱུན་ཆད་པ་དང་། མི་དྲང་བའི་རྒྱུན་ཆད་པ་སྟེ།
en: They are being deceitful and being dishonest.

source: རྒྱུན་ཆད་པ་གཉིས་པོ་དེ་དག་གོ། །
en: Those are the two interruptions.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རྒྱུན་མི་ཆད་པ་གཉིས་ཏེ།
en: “Furthermore, lord of nāgas, there are two factors that restore the mind of omniscience.

source: དྲན་པ་དང་། སྒྱུ་མེད་པས་རྒྱུན་མི་ཆད་པ་སྟེ།
en: They are mindfulness and not being deceitful.

source: རྒྱུན་མི་ཆད་པ་གཉིས་པོ་དེ་དག་གོ། །
en: Those are the two restorers.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་སྒྲིབ་པ་གསུམ་སྟེ།
en: “Furthermore, lord of nāgas, there are three factors that create obscurations to the mind of omniscience.

source: གསུམ་གང་ཞེ་ན།
en: What are the three?

source: ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་སྟེ།
en: They are negative behavior of the body, negative behavior of speech, and negative behavior of mind.

source: གསུམ་པོ་དེ་དག་གོ། །
en: Those are the three.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་སྒྲིབ་པ་མེད་པ་གསུམ་སྟེ།
en: “Furthermore, lord of nāgas, there are three factors that eliminate obscurations to the mind of omniscience.

source: ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་སྟེ།
en: They are positive behavior of the body, positive behavior of speech, and positive behavior of mind.

source: སྒྲིབ་པ་མེད་པ་གསུམ་པོ་དེ་དག་གོ། །
en: Those are the three factors that eliminate obscurations.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་སྒྲིབ་པ་བཞི་སྟེ།
en: “Lord of nāgas, there are four further factors that obscure the mind of omniscience.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the four?

source: དམ་པའི་ཆོས་སྤོང་བ་དང་། བླ་མ་རྣམས་ལ་མི་གུས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཞེ་སྡང་བ་དང་། བདུད་ཀྱི་ལས་ཁོང་དུ་མི་ཆུད་པ་སྟེ།
en: They are rejecting the sacred Dharma, lacking devotion toward teachers, bearing hostility toward bodhisattvas, and not comprehending the deeds of Māra.

source: སྒྲིབ་པ་བཞི་པོ་དེ་དག་གོ། །
en: Those are the four obscurations.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་སྒྲིབ་པ་མེད་པ་བཞི་སྟེ།
en: “Lord of nāgas, there are four further factors that eliminate obscurations to the mind of omniscience.

source: བཞི་གང་ཞེ་ན།
en: What are the four?

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། བླ་མ་རྣམས་ལ་གུས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྟོན་པ་ལྟར་ཕངས་པར་སེམས་པ་དང་། བདུད་ཀྱི་ལས་ཁོང་དུ་ཆུད་པ་སྟེ།
en: They are maintaining the sacred Dharma, having proper devotion for teachers, cherishing bodhisattvas as if they were the Teacher, and comprehending the deeds of Māra.

source: སྒྲིབ་པ་མེད་པ་བཞི་པོ་དེ་དག་གོ། །
en: Those are the four factors that eliminate obscurations.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རིན་ཐང་མེད་པའི་ཆོས་ཐོབ་པ་ལྔ་སྟེ།
en: “Furthermore, lord of nāgas, there are five priceless qualities of the mind of omniscience.

source: ལྔ་གང་ཞེ་ན། རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བར་གཏོང་བ་དང་།
en: What are the five?

source: སྐྱེ་བ་རྣམས་ལ་མི་གནས་པའི་ཚུལ་ཁྲིམས་དང་། སེམས་ཅན་ཐམས་ཅད་མི་གཏོང་བའི་སྙིང་རྗེ་ཆེན་པོ་དང་། བྱམས་པ་དང་མི་བྱམས་པ་རྣམས་ལ་མི་ལྟ་བར་ལུས་དང་སྲོག་ཡོངས་སུ་གཏོང་བ་དང་། ཐོབ་པ་དང་། བཀུར་སྟི་དང་།
en: They are having generosity without expecting any reward, discipline that does not dwell on future rebirths, great compassion that does not abandon any being, sacrificing life and limb without discriminating between those who are kind and those who are unkind, and teaching the Dharma without seeking gain, veneration, or praise.

source: ཚིགས་སུ་བཅད་པ་མི་ཚོལ་བར་ཆོས་སྟོན་པ་སྟེ། ཀླུའི་བདག་པོ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རིན་ཐང་མེད་པའི་ཆོས་ཐོབ་པ་ལྔ་པོ་དེ་དག་གོ། །
en: Lord of nāgas, those are the five priceless qualities attained through the mind of omniscience.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རྟུལ་བ་ལྔ་སྟེ།
en: “Furthermore, lord of nāgas, there are five resolutions of the mind of omniscience.

source: ལྔ་གང་ཞེ་ན།
en: What are the five?

source: དགེ་བའི་བཤེས་གཉེན་ལ་སྟེན་པ་དང་། འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། ཡེ་ཤེས་ལ་མངོན་པའི་ང་རྒྱལ་མེད་པ་དང་། དུས་མ་ཡིན་པར་རྙེད་པ་རྣམ་པར་སྤོང་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མཐའ་ཡས་པ་ལ་ཞུམ་པ་མེད་པ་སྟེ།
en: They are to follow a spiritual friend, to not be disheartened in saṃsāra, to not be conceited with regard to wisdom, to forsake untimely gains, and to not be timid with regard to the limitless wisdom of the buddhas.

source: ཀླུའི་བདག་པོ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རྟུལ་བ་ལྔ་པོ་དེ་དག་གོ། །
en: Lord of nāgas, those are the five resolutions of the mind of omniscience.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་ཁྱད་པར་དུ་འཕགས་པ་གང་དག་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ལ་མེད་པ་ལྔ་སྟེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has five noble aspects that hearers and solitary buddhas lack.

source: ཉན་ཐོས་ལས་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་ཁྱད་པར་དུ་འཕགས་པ་དང་། རང་སངས་རྒྱས་ལས་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་ཁྱད་པར་དུ་འཕགས་པ་དང་། ཆོས་ཐམས་ཅད་བདག་མེད་པར་ཤེས་པས་ཁྱད་པར་དུ་འཕགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་ཤེས་པས་ཁྱད་པར་དུ་འཕགས་པ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་འཇོམས་པ་ཤེས་པས་ཁྱད་པར་དུ་འཕགས་པ་སྟེ།
en: They are the noble wisdom of liberation from the vehicle of the hearers, the noble wisdom of liberation from the vehicle of the solitary buddhas, the noble understanding of the selflessness of all phenomena, the noble understanding of the thoughts of all beings, and the noble understanding of how to halt the perpetuation of habitual tendencies.

source: ཁྱད་པར་དུ་འཕགས་པ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five noble aspects.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་མཆོག་ཏུ་དགའ་བ་ལྔ་སྟེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has five supreme joys.

source: ངན་འགྲོ་ལས་ཤིན་ཏུ་འདས་པས་མཆོག་ཏུ་དགའ་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་དང་ཉེ་བར་གྱུར་པས་མཆོག་ཏུ་དགའ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡང་དག་པར་མཐོང་བ་ཡོངས་སུ་རྫོགས་པས་མཆོག་ཏུ་དགའ་བ་དང་། ཚུལ་ཁྲིམས་ལ་ནན་ཏན་བྱེད་པ་ལ་འགྱོད་པ་མེད་པས་མཆོག་ཏུ་དགའ་བ་དང་། སེམས་ཅན་གྱི་དོན་བྱ་བ་མྱོང་བས་མཆོག་ཏུ་དགའ་བ་སྟེ།
en: They are the supreme joy of passing beyond the lower realms, the supreme joy of approaching omniscience, the supreme joy of perfecting the wisdom vision of the buddhas, the supreme joy of being without regret by diligently observing discipline, and the supreme joy experienced through benefiting beings.

source: མཆོག་ཏུ་དགའ་བ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five supreme joys.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་སྟོབས་ལྔ་སྟེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has five powers.

source: ལྔ་གང་ཞེ་ན། ང་རྒྱལ་བཅོམ་པས་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: What are the five?

source: ཐོས་པ་དང་མ་བྲལ་བས་ཤེས་རབ་ཀྱི་སྟོབས་དང་། ཁོང་ཁྲོ་བ་མེད་པས་བྱམས་པའི་སྟོབས་དང་། མཚན་ཡོངས་སུ་རྫོགས་པས་བཟོད་པའི་སྟོབས་དང་། འཁོར་དུ་བག་ཚ་བ་དང་། འཇིགས་པ་དང་བྲལ་བས་མི་འཇིགས་པའི་སྟོབས་ཏེ།
en: They are the power of wisdom through overcoming pride, the power of insight through being inseparable from learning, the power of love through the absence of anger, the power of patience through perfecting the marks, and the power of fearlessness through being without fear and anxiety in the presence of others.

source: སྟོབས་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five powers.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེའི་རིགས་པ་གང་གིས་རིགས་པ་མ་ཡིན་པར་མི་ལྟུང་བའི་རིགས་པ་ལྔ་སྟེ།
en: “Furthermore, lord of nāgas, the mind of omniscience has five modes of reasoning that do not fall into irrationality.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པའི་རིགས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་མི་འགལ་བའི་རིགས་པ་དང་། དུས་དང་དུས་མ་ཡིན་པ་ལ་སོ་སོར་རྟོག་པའི་རིགས་པ་དང་། ཡང་དག་པར་སྦྱོར་བའི་རིགས་པ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་སྒྲུབ་པའི་རིགས་པ་སྟེ།
en: They are reasoning with confidence in the ripening of karma, reasoning that does not err in its understanding of dependent origination, reasoning that discerns what is timely and what is untimely, reasoning that engages accurately, and reasoning that validates all virtuous qualities.

source: རིགས་པ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five reasonings.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱི་ཤིང་ལྗོན་པ་དེའི་སྣང་བ་ལྔ་དང་། ས་བོན་ལྔ་དང་། རྩ་བ་ལྔ་དང་། སྡོང་པོ་ལྔ་དང་། ཡལ་ག་ལྔ་དང་།
en: “Furthermore, lord of nāgas, the tree of the mind of omniscience has five appearances, five seeds, five roots, five trunks, five branches, five leaves, five flowers, and five fruits.

source: ལོ་མ་ལྔ་དང་། མེ་ཏོག་ལྔ་དང་། འབྲས་བུ་ལྔའོ། །དེ་ལ་དེའི་སྣང་བ་ལྔ་གང་ཞེ་ན།
en: What are the five appearances?

source: ཉོན་མོངས་པ་དང་བྲལ་བའི་སྣང་བ་དང་། རང་གི་སེམས་ངེས་པར་སེམས་པའི་སྣང་བ་དང་། ཤེས་རབ་ཀྱི་སྣང་བ་དང་། མིག་ལྔའི་སྣང་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་སྟེ།
en: They are the appearance of being free of afflictions, the appearance of being sure in one’s own mind, the appearance of insight, the appearance of the five eyes, and the appearance of omniscient wisdom.

source: སྣང་བ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five appearances.

source: དེ་ལ་ས་བོན་ལྔ་གང་ཞེ་ན།
en: “What are the five seeds?

source: བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་དང་། སེམས་ཅན་ལ་ལྟ་བ་དང་། མོས་པ་དང་། རྒྱ་ཆེན་པོ་ལ་མོས་པ་སྟེ།
en: They are intention, resolve, concern for beings, devotion, and dedication to the vast.

source: ས་བོན་ལྔ་པོ་དེ་དག་གོ །
en: Those are the five seeds.

source: དེ་ལ་རྩ་བ་ལྔ་གང་ཞེ་ན།
en: “What are the five roots?

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགེ་བའི་རྩ་བས་མི་ངོམས་ཤིང་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་སྔོ་བ་དང་། ཉེས་པ་བརྟུལ་བས་འཆགས་པ་དང་། ཐེག་པ་གཞན་མི་འདོད་པ་སྟེ།
en: They are great love, great compassion, never being satisfied by one’s roots of virtue and dedicating one’s roots of virtue, courageously confessing one’s faults, and having no interest in other vehicles.

source: རྩ་བ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five roots.

source: དེ་ལ་སྡོང་པོ་ལྔ་གང་ཞེ་ན།
en: “What are the five trunks?

source: ཐབས་ལ་མཁས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། རྗེས་སུ་ཆགས་པ་དང་།
en: They are skillful means, the perfection of insight, bringing beings to maturity, maintaining the sacred Dharma, and impartiality free from attachment and aversion.

source: ཁོང་ཁྲོ་བ་དང་བྲལ་བས་བཏང་སྙོམས་པ་སྟེ་སྡོང་པོ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five trunks.

source: དེ་ལ་ཡལ་ག་ལྔ་གང་ཞེ་ན།
en: “What are the five branches?

source: སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་ཏེ།
en: They are generosity, discipline, patience, diligence, and concentration.

source: ཡལ་ག་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five branches.

source: དེ་ལ་ལོ་མ་ལྔ་གང་ཞེ་ན།
en: “What are the five leaves?

source: ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཁྱིམ་ནས་འབྱུང་བ་དང་དགོན་པ་ལ་གནས་པ་དང་། འཕགས་པའི་རིགས་ཆོག་ཤེས་པ་སྟེ།
en: They are discipline, learning, renouncing one’s home, living in seclusion, and finding contentment in the noble lineage.

source: ལོ་མ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five leaves.

source: དེ་ལ་མེ་ཏོག་ལྔ་གང་ཞེ་ན།
en: “What are the five flowers?

source: བསོད་ནམས་བསགས་པས་མཚན་ཕུན་སུམ་ཚོགས་པ་དང་། སྦྱིན་པ་སྣ་ཚོགས་བསགས་པས་དཔེ་བྱད་བཟང་པོ་ཕུན་སུམ་ཚོགས་པ་དང་། སེམས་ངེས་པར་སེམས་པས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཕུན་སུམ་ཚོགས་པ་དང་། ཆོས་རྣམ་པར་འགྲེལ་པས་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། གཟུངས་རབ་ཏུ་ཐོབ་པས་བརྗེད་ངས་པ་མེད་པ་ཕུན་སུམ་ཚོགས་པ་སྟེ།
en: They are the excellent major marks that come with the accumulation of merit, the excellent minor marks that come with the accumulation of various acts of generosity, the excellent branches of awakening that come through ascertaining the mind, excellent eloquence that comes through explaining aspects of the Dharma, and excellent flawless memory that comes through achieving the power of retention.

source: མེ་ཏོག་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five flowers.

source: དེ་ལ་འབྲས་བུ་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What are the five fruits?

source: སློབ་པའི་འབྲས་བུ་ཐོབ་པ་དང་། མི་སློབ་པའི་འབྲས་བུ་ཐོབ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་འབྲས་བུ་ཐོབ་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སའི་འབྲས་བུ་ཐོབ་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་འབྲས་བུ་ཐོབ་པ་སྟེ།
en: They are attaining the fruit of training, the fruit of passing beyond training, the fruit of a solitary buddha, the fruit of the bodhisattva level of irreversibility, and the fruit of omniscient wisdom.

source: འབྲས་བུ་ལྔ་པོ་དེ་དག་གོ། །
en: Those are the five fruits.

source: ཀླུའི་བདག་པོ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱི་ཤིང་ལྗོན་པ་དེའི་སྣང་བ་ནི་དེ་ལྟ་བུའོ། །ས་བོན་ནི་དེ་ལྟ་བུའོ། །རྩ་བ་ནི་དེ་ལྟ་བུའོ། །སྡོང་པོ་ནི་དེ་ལྟ་བུའོ། །ཡལ་ག་ནི་དེ་ལྟ་བུའོ། །
en: “Lord of nāgas, these are the appearances, seeds, roots, trunks, branches, leaves, flowers, and fruits of the tree of the mind of omniscience.

source: ལོ་མ་ནི་དེ་ལྟ་བུའོ། །མེ་ཏོག་ནི་དེ་ལྟ་བུའོ། །འབྲས་བུ་ནི་དེ་ལྟ་བུའོ། །ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པའི་ཤིང་ལྗོན་པ་འདི་ལྟ་བུ་ཡོངས་སུ་འཛིན་པར་འདོད་པས་ཐམས་ཅད་མཁྱེན་པའི་སེམས་མི་བརྗེད་པར་བྱ་སྟེ།
en: Therefore, lord of nāgas, a bodhisattva who aspires to having such a tree of the mind omniscience must not forget the mind of omniscience.

source: ཀླུའི་བདག་པོ་གང་གིས་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཤིན་ཏུ་བཟུང་བ་དེས་གང་དག་ཡོངས་སུ་ཟིན་པར་མ་གྱུར་པའི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ངས་མ་མཐོང་ངོ་། །ཀླུའི་བདག་པོ་འདི་ལྟ་སྟེ།
en: Lord of nāgas, I have not seen any excellent qualities lacking in those who have the mind of omniscience.

source: དཔེར་ན་གང་གིས་ཤིང་གང་གིས་ས་བོན་བཟུང་བར་གྱུར་པ་དེས་དེའི་རྩ་བ་དང་། སྡོང་པོ་དང་། ཡལ་ག་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་།
en: Lord of nāgas, someone who possesses the seed of a tree also possesses its roots, trunks, branches, leaves, flowers, and fruits.

source: འབྲས་བུ་རྣམས་ཀྱང་བཟུང་བ་ཡིན་ནོ། །ཀླུའི་བདག་པོ་དེ་བཞིན་དུ་གང་གིས་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཤིན་ཏུ་བཟུང་བ་དེས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བཟུང་བ་ཡིན་ནོ། །
en: In the same way, lord of nāgas, someone who possesses the mind of omniscience also possesses the factors of awakening.

source: ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་འབྱུང་གནས་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ལ་འཇུག་པའི་ཆོས་ཀྱི་སྒོའི་ལེའུ་འདི་ཟུང་ཤིག །
en: Therefore, lord of nāgas, this teaching, which is a Dharma gateway on the qualities of bodhisattvas, should be remembered.

source: ཆོངས་ཤིག །ལྷོགས་ཤིག །འཁོར་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་ཤོད་ཅིག །
en: Retain it, recite it, and explain it widely to those around you!

source: ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: This is how you should train.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་འབྱུང་གནས་ཀྱི་ལེའུ་འདི་བཤད་པ་ན་འཁོར་དེ་ལས་ཀླུ་བདུན་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When the Blessed One delivered this teaching on the source of the wisdom of omniscience, seventy-two thousand nāgas from among those assembled there developed the intention to reach unsurpassed and perfect awakening.

source: དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་ཀླུ་གཞོན་ནུ་རྣམས་དང་། ཀླུའི་བུ་མོ་རྣམས་དང་། ཀླུའི་རྒྱལ་པོ་རྣམས་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །སྔར་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: Young nāgas, female nāgas, and nāga kings reached acceptance in keeping with the roots of virtue that they had produced, and five hundred of the assembled bodhisattvas reached acceptance of the unborn nature of phenomena.

source: དེ་ནས་ཀླུའི་བུ་དེ་དག་དང་། ཀླུའི་བུ་མོ་དང་། ཀླུའི་རྒྱལ་པོ་དེ་དག་སྟེང་གི་བར་སྣང་ལ་ལུས་མི་སྣང་བར་འཁོད་དེ། དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་སྤྲིན་ཆེན་པོ་བྱིན་གྱིས་བརླབས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཆར་རབ་ཏུ་ཕབ་བོ། །
en: Those nāga boys, nāga girls, and nāga kings ascended into the sky and disappeared, leaving in their wake a great cloud of benzoin resin that showered a rain of heavenly uragasāra sandalwood powder as an offering to the Blessed One.

source: མུ་ཏིག་གི་དྲ་བས་ཀྱང་ཐམས་ཅད་དང་ལྡན་པའི་ཡུལ་བྱིང་འཛིན་ཁེབས་པར་བྱས་སོ། །དོ་ཤལ་དང་ཟླ་གམ་ལྟ་བུ་རྣམས་ཀྱིས་ཀྱང་ནམ་མཁའི་ངོས་ཐམས་ཅད་མངོན་པར་ཁེབས་པར་བྱས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The land and everything in it was covered and enveloped by a lattice of pearls, and it was as if the entire surface of the sky were covered with necklaces and half-moon ornaments.

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་ཀྱི་སེམས་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་དང་། ཡོན་ཏན་དག་དང་། རྣམ་པ་དང་། འཇུག་པ་རབ་ཏུ་བཤད་པ་ནི་ངོ་མཚར་ཏོ། །
en: Then the nāga king Anavatapta said to the Blessed One, “Blessed One, the way the Thus-Gone One has explained the mind of awakening and the mind of omniscience—its qualities, aspects, and practices—is wonderful!
